БухЭксп/Catalogs/CW_ПлановыеСтатьиЗатратИДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПлановыеСтатьиЗатратИДоходов</Name>
			<Comment>Бюджетирование грузоперевозок</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_Грузоперевозки</xr:Item>
				<xr:Item>Catalog.CW_ВариантыБюджетовПоЗаявкам</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтатьиПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыСтатейПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДатаКурсаДляПроверки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияДоходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма без НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсего</Name>
					<Comment>Сумма, включая НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсегоРуб</Name>
					<Comment>Сумма, включая НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСРуб</Name>
					<Comment>Сумма НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРуб</Name>
					<Comment>Сумма без НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаРуб</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКурсаВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПрогноза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКонтрольнаяДата</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКоличествоДнейПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантыНаценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРаспределенияСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДСВСебестоимости</Name>
					<Comment>Учитывать НДСВСебестоимости</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ИсторияУтверждениеБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ИсторияУтверждениеБюджетов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыБюджетовПоЗаявкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПризнакУтверждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПрогнозОплатыПлановыхСтатейБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПрогнозОплатыПлановыхСтатейБюджета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрогнозДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыСтатейПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыСтатейПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПлановыеСтатьиЗатратИДоходов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СкопироватьСтатьиБюджета(ПараметрыПроцедуры, АдресРезультата = Неопределено) Экспорт
	
	СтруктураУтверждения = РегистрыСведений.CW_ИсторияУтверждениеБюджетов.ПолучитьСтатусУтвержденияВерсииБюджета(ПараметрыПроцедуры.ОбъектБюджета, ПараметрыПроцедуры.ВерсияБюджета);
	Если СтруктураУтверждения.Утвреждена Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого КопируемаяСсылка из ПараметрыПроцедуры.МассивСсылок Цикл
		Копия = КопируемаяСсылка.Скопировать();
		Копия.ВидСтатьиПланирования = ПараметрыПроцедуры.ВидСтатьиПланирования;
		Копия.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьКоличествоПлановыхСтатей(ПараметрыПроцедуры, АдресРезультата = Неопределено) Экспорт
	
	Для Каждого СтатьяБюджета из ПараметрыПроцедуры.МассивСтатей Цикл  
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТипПеревозки", 		СтатьяБюджета.Владелец.ТипПеревозки);
		СтруктураПараметров.Вставить("Номенклатура", 		СтатьяБюджета.Номенклатура);
		СтруктураПараметров.Вставить("ЕдиницаИзмерения", 	СтатьяБюджета.ЕдиницаИзмерения);
		
		НайденныйПараметр 	= CW_Документы.ПолучитьПараметрДляПодстановкиЗначенияВКоличество(СтруктураПараметров); 
		Если НайденныйПараметр = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураЗначения = РегистрыСведений.CW_ХарактеристикиГрузоперевозок.ПолучитьЗначениеПараметра(СтатьяБюджета.Владелец, НайденныйПараметр);
		Если СтруктураЗначения.Значение <> Неопределено Тогда
			
            СтатьяБюджетаОбъект = СтатьяБюджета.ПолучитьОбъект();
			СтатьяБюджетаОбъект.Количество = СтруктураЗначения.Значение; 
			
			СтавкаНДСПроцент 	= CW_Финансы.ПолучитьСтавкуНДС(СтатьяБюджетаОбъект.СтавкаНДС); 
			
			СтатьяБюджетаОбъект.Сумма 		= Окр(СтатьяБюджетаОбъект.Количество * СтатьяБюджетаОбъект.Цена, 2);
			СтатьяБюджетаОбъект.СуммаНДС 	= CW_Финансы.РассчитатьСуммуНДС(СтатьяБюджетаОбъект.Сумма, Истина, Ложь, СтавкаНДСПроцент);
			СтатьяБюджетаОбъект.СуммаВсего 	= СтатьяБюджетаОбъект.Сумма + СтатьяБюджетаОбъект.СуммаНДС;
			
			СтатьяБюджетаОбъект.СуммаРуб 		= СтатьяБюджетаОбъект.Сумма * СтатьяБюджетаОбъект.Курс;
			СтатьяБюджетаОбъект.СуммаНДСРуб 	= CW_Финансы.РассчитатьСуммуНДС(СтатьяБюджетаОбъект.СуммаРуб, Истина, Ложь, СтавкаНДСПроцент);
			СтатьяБюджетаОбъект.СуммаВсегоРуб 	= СтатьяБюджетаОбъект.СуммаРуб + СтатьяБюджетаОбъект.СуммаНДСРуб;   
			СтатьяБюджетаОбъект.ЦенаРуб 		= ?(СтатьяБюджетаОбъект.Количество = 0, 0,СтатьяБюджетаОбъект.СуммаРуб/СтатьяБюджетаОбъект.Количество);
			
			СтатьяБюджетаОбъект.Записать();
		КонецЕсли;  
		
	КонецЦикла;

КонецПроцедуры

Процедура СоздатьСтатьиБюджетаПоМассивуГрузоперевозок(ПараметрыПроцедуры, АдресРезультата = Неопределено) Экспорт
	
	//Использование количества
	ИспользованиеКоличестваДляПлановыхСтатей 			= ПолучитьФункциональнуюОпцию("CW_ИспользованиеКоличестваДляПлановыхСтатей");
	ПолучениеКоличестваУслугИзПараметраГрузоперевозки 	= ПолучитьФункциональнуюОпцию("CW_РазрешитьПолучениеКоличестваУслугИзПараметраГрузоперевозки");
	//Использование количества

	ИспользуетсяПрогнозированиеДДСПоБюджету = ПолучитьФункциональнуюОпцию("CW_ИспользуетсяПрогнозированиеДДСПоБюджету"); 
	
	НачатьТранзакцию();
	
	Для Каждого ГрузоперевозкаСсылка Из ПараметрыПроцедуры.МассивГрузоперевозок Цикл   
		
		СтрукутраВалютаБюджета = Справочники.CW_ТипыПеревозок.ПолучитьВалютуДатуКурсаБюджета(ГрузоперевозкаСсылка.ТипПеревозки, ПараметрыПроцедуры.ВидСтатьиПланирования); 
		
		УчитыватьНДСВСебестоимости = CW_Настройки.ПараметрУчетнойПолитики(ТекущаяДата(), ПараметрыПроцедуры.Организация, "УчитыватьНДСВСебестоимости");
	
		СтатьяОбъект = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьЭлемент();
		
		Если ПараметрыПроцедуры.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда 
			НастройкиПараметров = CW_Бюджетирование.ПолучитьНастройкиПараметровЗаполнения();  
			Если НастройкиПараметров.МассивПараметов.Количество() > 0 Тогда
				ЗначенияПараметров = CW_Бюджетирование.ПолучитьЗначенияПараметров(ГрузоперевозкаСсылка, НастройкиПараметров.МассивПараметов); 
				Для Каждого Параметр из НастройкиПараметров.МассивПараметов Цикл
					ИмяРеквизита 		= НастройкиПараметров.СоответствиеРеквизитов.Получить(Параметр);  
					Если ИмяРеквизита = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					СтатьяОбъект[ИмяРеквизита] = ЗначенияПараметров.Получить(Параметр); 
				КонецЦикла;
			КонецЕсли;    
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтатьяОбъект.Контрагент) Тогда
			СтатьяОбъект.Контрагент 		= ПараметрыПроцедуры.Контрагент; 
		КонецЕсли;

		СтатьяОбъект.Владелец 					= ГрузоперевозкаСсылка; 
		СтатьяОбъект.ВерсияБюджета 				= ПараметрыПроцедуры.ВерсияБюджета; 
		СтатьяОбъект.Организация 				= ПараметрыПроцедуры.Организация; 
		СтатьяОбъект.ВидСтатьиПланирования 		= ПараметрыПроцедуры.ВидСтатьиПланирования; 
		СтатьяОбъект.Валюта 					= ПараметрыПроцедуры.Валюта; 
		СтатьяОбъект.УчитыватьНДСВСебестоимости = ?(СтатьяОбъект.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы"),УчитыватьНДСВСебестоимости,Ложь);
		
		
		КурсВалюты 	= CW_Финансы.ПолучитьКурсВалюты(ПараметрыПроцедуры.Валюта,ТекущаяДата());
		СтатьяОбъект.Курс		= КурсВалюты.Курс;
		СтатьяОбъект.Кратность	= КурсВалюты.Кратность;
		
		СтатьяОбъект.Номенклатура 						= ПараметрыПроцедуры.Номенклатура; 
		СтатьяОбъект.СтавкаНДС 							= ПараметрыПроцедуры.СтавкаНДС; 
		СтатьяОбъект.ЕдиницаИзмерения 					= ПараметрыПроцедуры.ЕдиницаИзмерения;  
		СтатьяОбъект.Количество							= 1;
		СтатьяОбъект.ЦенаСНДС							= ПараметрыПроцедуры.ЦенаСНДС;
		СтатьяОбъект.ТипКурсаВалюты 					= СтрукутраВалютаБюджета.ТипКурсаВалюты;
		СтатьяОбъект.КонтрольнаяДатаКурсаДляПроверки 	= СтрукутраВалютаБюджета.ДатаКурса;
	
		Если ПараметрыПроцедуры.ВидСтатьиПланирования = перечисления.CW_ВидыСтатейПланирования.Доходы Тогда
			СтатьяОбъект.ПорядокОтраженияДоходов			= ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга");
		ИначеЕсли ПараметрыПроцедуры.ВидСтатьиПланирования = перечисления.CW_ВидыСтатейПланирования.Расходы Тогда
			СтатьяОбъект.ПорядокОтраженияРасходов			= ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты");;
		КонецЕсли;
		
		Если ИспользованиеКоличестваДляПлановыхСтатей и ПолучениеКоличестваУслугИзПараметраГрузоперевозки Тогда 
			ЗаполнитьКоличествоДляСтатьи(СтатьяОбъект);
		КонецЕсли;
		
		CW_Бюджетирование.ПересчитатьСтатьюБюджетаПоКурсу(СтатьяОбъект);	

		Если ЗначениеЗаполнено(ПараметрыПроцедуры.ЗначениеКопирования) Тогда 
			ЗаполнитьЗначенияСвойств(СтатьяОбъект, ПараметрыПроцедуры.ЗначениеКопирования, , "Родитель");
		КонецЕсли;    
		
		СтатьяОбъект.Записать();
		
		//ПрогнозОплаты
		Если ИспользуетсяПрогнозированиеДДСПоБюджету Тогда
			РегистрыСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета.ЗаписатьПрогнозОплаты(СтатьяОбъект.Ссылка,  ГрузоперевозкаСсылка.ДатаСделкиФ);
		КонецЕсли;
		//ПрогнозОплаты
		
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры        		

Процедура ЗаполнитьКоличествоДляСтатьи(СтатьяОбъект)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТипПеревозки", 		СтатьяОбъект.Владелец.ТипПеревозки);
	СтруктураПараметров.Вставить("Номенклатура", 		СтатьяОбъект.Номенклатура);
	СтруктураПараметров.Вставить("ЕдиницаИзмерения", 	СтатьяОбъект.ЕдиницаИзмерения);

	НайденныйПараметр 	= CW_Документы.ПолучитьПараметрДляПодстановкиЗначенияВКоличество(СтруктураПараметров); 
	Если НайденныйПараметр <> Неопределено Тогда 
		
		СтруктураЗначения = РегистрыСведений.CW_ХарактеристикиГрузоперевозок.ПолучитьЗначениеПараметра(СтатьяОбъект.Владелец, НайденныйПараметр);
		Если СтруктураЗначения.Значение <> Неопределено Тогда
			СтатьяОбъект.Количество = СтруктураЗначения.Значение; 
		КонецЕсли;  
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(СтатьяОбъект.Количество) Тогда
		СтатьяОбъект.Количество = 1;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМассивДоступныхПарамтеровОбъекта(ВладелецСтатьи) Экспорт
	
	Массив = Новый Массив;	
	
	ПолучитьДополнительныеДанные = Ложь;   
	Заказ = Неопределено;
	
	Если ТипЗнч(ВладелецСтатьи) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		ИмяОсновногоРегистра = "CW_ХарактеристикиГрузоперевозок"; 
		
		Заказ = ВладелецСтатьи.Заказ;
		ПолучитьДополнительныеДанные = Истина;   
	ИначеЕсли  ТипЗнч(ВладелецСтатьи) = Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам") Тогда 
		ИмяОсновногоРегистра 	= 	"CW_ХарактеристикиЗаявок";   
	Иначе
		Возврат Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	CW_Характеристики.Параметр КАК Параметр
	|ПОМЕСТИТЬ ВТ_Параметры
	|ИЗ
	|	РегистрСведений."+ИмяОсновногоРегистра+" КАК CW_Характеристики
	|ГДЕ
	|	//УсловиеВладелец
	|";
	
	Если ТипЗнч(ВладелецСтатьи) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Если ПолучитьДополнительныеДанные и ЗначениеЗаполнено(Заказ) Тогда
			
			Запрос.Текст = Запрос.Текст +"
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	CW_ХарактеристикиЗаказов.Параметр
			|ИЗ
			|	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
			|ГДЕ
			|	CW_ХарактеристикиЗаказов.Заказ = &Заказ
			|";        
			
		КонецЕсли;  
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст +";
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Параметры.Параметр КАК Параметр,
	|	ВТ_Параметры.Параметр.ЭтоКонтрольнаяДата КАК ЭтоКонтрольнаяДата
	|ИЗ
	|	ВТ_Параметры КАК ВТ_Параметры
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Параметры.Параметр";
	
	Запрос.УстановитьПараметр("Заказ", 			Заказ);
	
	Если ТипЗнч(ВладелецСтатьи) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Запрос.УстановитьПараметр("ВладелецСтатьи", ВладелецСтатьи);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеВладелец", "CW_Характеристики.Грузоперевозка = &ВладелецСтатьи");    
	КонецЕсли;
	Если ТипЗнч(ВладелецСтатьи) = Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам") Тогда
		Запрос.УстановитьПараметр("ВладелецСтатьи", ВладелецСтатьи.Владелец);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеВладелец", "CW_Характеристики.Заявка = &ВладелецСтатьи");    
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Параметр.ТипЗначения.СодержитТип(Тип("Дата")) 
			или Выборка.ЭтоКонтрольнаяДата Тогда
			Массив.Добавить(Выборка.Параметр);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции


Процедура РассчитатьПрогнозОплаты(СтатьиБюджета) Экспорт  
	
	СоответствиеПрогнозаДаты = ПолучитьСоответствиеПрогнозаДаты(СтатьиБюджета);
	
	Для Каждого СтатьяБюджета из СтатьиБюджета Цикл   
		ПрогнозДата = СоответствиеПрогнозаДаты.Получить(СтатьяБюджета); 
		
		Если ТипЗнч(СтатьяБюджета.Владелец) <> Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			Продолжить;
		КонецЕсли;

		ДатаНачалаПеревозки = СтатьяБюджета.Владелец.ДатаСделкиФ;
	
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("ВариантПрогноза", 			СтатьяБюджета.ВариантПрогноза);
		ПараметрыРасчета.Вставить("Владелец", 					СтатьяБюджета.Владелец);
		ПараметрыРасчета.Вставить("ПрогнозКонтрольнаяДата", 	СтатьяБюджета.ПрогнозКонтрольнаяДата);
		ПараметрыРасчета.Вставить("ПрогнозКоличествоДней", 		СтатьяБюджета.ПрогнозКоличествоДней);
		ПараметрыРасчета.Вставить("ПрогнозКоличествоДнейПлан", 	СтатьяБюджета.ПрогнозКоличествоДнейПлан);
	
		ПараметрыРасчета.Вставить("ПрогнозДата",	 			ПрогнозДата);
		ПараметрыРасчета.Вставить("ДатаНачалаПеревозки", 		ДатаНачалаПеревозки);
		
		ПрогнозДата = РассчитатьПрогнозОплатыСтатьиБюджета(ПараметрыРасчета);  
		
		Если ПрогнозДата<> Неопределено Тогда 
			
			РегистрыСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета.ЗаписатьПрогнозОплаты(СтатьяБюджета, ПрогнозДата);
			
			ЗаписьЖурналаРегистрации("Расчет прогноза оплаты",
						УровеньЖурналаРегистрации.Информация, 
						Метаданные.Справочники.CW_ПлановыеСтатьиЗатратИДоходов,
						СтатьяБюджета, 
						"Расчет прогоноза оплаты");
		Конецесли;
					
	КонецЦикла;

КонецПроцедуры  

Функция ПолучитьСоответствиеПрогнозаДаты(мСтатьиБюджета)  
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПрогнозОплатыПлановыхСтатейБюджета.СтатьяБюджета КАК СтатьяБюджета,
	               |	CW_ПрогнозОплатыПлановыхСтатейБюджета.ПрогнозДата КАК ПрогнозДата
	               |ИЗ
	               |	РегистрСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета КАК CW_ПрогнозОплатыПлановыхСтатейБюджета
	               |ГДЕ
	               |	CW_ПрогнозОплатыПлановыхСтатейБюджета.СтатьяБюджета В (&мСтатьиБюджета)";
	
	Запрос.УстановитьПараметр("мСтатьиБюджета", мСтатьиБюджета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.СтатьяБюджета, Выборка.ПрогнозДата);
	КонецЦикла;                                                        
	
	Возврат Результат;
	
КонецФункции

Функция РассчитатьПрогнозОплатыСтатьиБюджета(Знач ПараметрыРасчета) Экспорт     
	
	Если ТипЗнч(ПараметрыРасчета.Владелец) <> Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПараметрыРасчета.ВариантПрогноза = 2 Тогда
		Возврат ПараметрыРасчета.ПрогнозДата;
	КонецЕсли;  
	
	НачальнаяДата 	= ПараметрыРасчета.ДатаНачалаПеревозки;  

	Если ПараметрыРасчета.ВариантПрогноза = 0 Тогда   
		//от даты начала переовзки
		КоличествоДней 	= ПараметрыРасчета.ПрогнозКоличествоДней;
	КонецЕсли;
	
	Если ПараметрыРасчета.ВариантПрогноза = 1 Тогда 
		//от контрольной переовзки    
		КоличествоДней 	= ПараметрыРасчета.ПрогнозКоличествоДнейПлан; 
		
		Если ЗначениеЗаполнено(ПараметрыРасчета.ПрогнозКонтрольнаяДата) Тогда
			
			ДатаПараметра 	= ПолучитьЗначениеПараметра(ПараметрыРасчета.Владелец, ПараметрыРасчета.ПрогнозКонтрольнаяДата);
			Если ЗначениеЗаполнено(ДатаПараметра) Тогда
				НачальнаяДата 	= ДатаПараметра; 
				КоличествоДней 	= ПараметрыРасчета.ПрогнозКоличествоДней;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НачальнаяДата + (КоличествоДней * 86400);  
	
КонецФункции

Функция ПолучитьЗначениеПараметра(Знач ВладелецСтатьи, Знач Параметр)
	
	Запрос = Новый Запрос;
	ЗапросТекст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Характеристики.Параметр КАК Параметр,
	               |	Характеристики.Значение КАК Значение
	               |ИЗ
	               |	//ТАБЛИЦАРЕГИСТРА 
	               |ГДЕ
	               |	//УСЛОВИЕ_ВЛАДЕЛЕЦ 
	               |	И Характеристики.Параметр = &Параметр";     
	
	Запрос.УстановитьПараметр("Параметр", Параметр); 

	Если ТипЗнч(ВладелецСтатьи) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Запрос.Текст = СтрЗаменить(ЗапросТекст, "//ТАБЛИЦАРЕГИСТРА", "РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК Характеристики"); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ВЛАДЕЛЕЦ", "Характеристики.Грузоперевозка = &ВладелецСтатьи"); 
		Запрос.УстановитьПараметр("ВладелецСтатьи", ВладелецСтатьи); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗначениеДаты = Выборка.Значение;
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ЗначениеДаты) 
			И ЗначениеЗаполнено(ВладелецСтатьи.Заказ) Тогда     
			
			Запрос.Текст = СтрЗаменить(ЗапросТекст, "//ТАБЛИЦАРЕГИСТРА", "РегистрСведений.CW_ХарактеристикиЗаказов КАК Характеристики"); 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ВЛАДЕЛЕЦ", "Характеристики.Заказ = &ВладелецСтатьи"); 
			Запрос.УстановитьПараметр("ВладелецСтатьи", ВладелецСтатьи.Заказ); 
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Следующий() Тогда
				ЗначениеДаты = Выборка.Значение;
			КонецЕсли; 
			
		КонецЕсли;
		
		Возврат ЗначениеДаты;
		
	ИначеЕсли ТипЗнч(ВладелецСтатьи) = Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ТАБЛИЦАРЕГИСТРА", "РегистрСведений.CW_ХарактеристикиЗаявок КАК Характеристики");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ВЛАДЕЛЕЦ", "Характеристики.Заявка = &ВладелецСтатьи"); 
		Запрос.УстановитьПараметр("ВладелецСтатьи", ВладелецСтатьи.Владелец); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Значение;
		КонецЕсли;
	
	Иначе
		ВызватьИсключение "Неправильный тип валадльца статьи бюджета!";
	КонецЕсли; 
	
    Возврат Дата(1,1,1);
	
КонецФункции   

Функция ПолучитьРедактируемыеРеквизитыОбъекта(ВидСтатьиПланирования) Экспорт
	
	ИсключаемыеРеквизиты = Новый Массив;   
	ИсключаемыеРеквизиты.Добавить("Наименование"); 
	ИсключаемыеРеквизиты.Добавить("ВерсияБюджета"); 
	ИсключаемыеРеквизиты.Добавить("ВидСтатьиПланирования");  
	ИсключаемыеРеквизиты.Добавить("КонтрольнаяДатаКурсаДляПроверки");  
	ИсключаемыеРеквизиты.Добавить("СуммаВсегоРуб");  
	ИсключаемыеРеквизиты.Добавить("СуммаНДСРуб");  
	ИсключаемыеРеквизиты.Добавить("СуммаРуб");  
	ИсключаемыеРеквизиты.Добавить("ЦенаРуб");   
	ИсключаемыеРеквизиты.Добавить("ТипКурсаВалюты"); 
	ИсключаемыеРеквизиты.Добавить("ВариантПрогноза"); 
	ИсключаемыеРеквизиты.Добавить("ПрогнозКонтрольнаяДата"); 
	ИсключаемыеРеквизиты.Добавить("ПрогнозКоличествоДней"); 
	ИсключаемыеРеквизиты.Добавить("ПрогнозКоличествоДнейПлан"); 
	ИсключаемыеРеквизиты.Добавить("ПрогнозКоличествоДнейПлан"); 
	ИсключаемыеРеквизиты.Добавить("ПорядокРаспределенияСуммы"); 
	
	ИсключаемыеРеквизиты.Добавить("CW_Автор");
	ИсключаемыеРеквизиты.Добавить("CW_ДатаРедактирования");
	ИсключаемыеРеквизиты.Добавить("CW_ДатаСоздания");
	ИсключаемыеРеквизиты.Добавить("CW_Редактор"); 
	
	Если ВидСтатьиПланирования = "БюджетДоходы" Тогда
		ИсключаемыеРеквизиты.Добавить("ПорядокОтраженияРасходов"); 
	КонецЕсли;
	Если ВидСтатьиПланирования = "БюджетРасходы" Тогда
		ИсключаемыеРеквизиты.Добавить("ПорядокОтраженияДоходов"); 
	КонецЕсли;
	
	МассивРеквизитов = Новый Массив;     

	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"Наименование");
	ДанныеРеквизита.Вставить("Заголовок", 	"Наименование");
	ДанныеРеквизита.Вставить("Значение", 	"");
	
	МассивРеквизитов.Добавить(ДанныеРеквизита); 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Реквизит из Метаданные.Справочники.CW_ПлановыеСтатьиЗатратИДоходов.Реквизиты Цикл
		Если ИсключаемыеРеквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;   
		
		ПустоеЗначение = Реквизит.Тип.ПривестиЗначение(Неопределено);
		
		ДанныеРеквизита = Новый Структура;
		ДанныеРеквизита.Вставить("Имя", 		Реквизит.Имя);
		ДанныеРеквизита.Вставить("Заголовок", 	Реквизит.Синоним);
		ДанныеРеквизита.Вставить("Значение", 	ПустоеЗначение);
		
		МассивРеквизитов.Добавить(ДанныеРеквизита);  
		
	КонецЦикла;  
	
	УстановитьПривилегированныйРежим(ложь);
	
	Возврат МассивРеквизитов;	
	
КонецФункции

Процедура ПересчетСуммСтатьи(Объект)  

	ОбратныйПересчетВДокументах  = CW_Настройки.ПолучитьНастройкуПользователя(,"ОбратныйПересчетВДокументах");
	
	Если ОбратныйПересчетВДокументах Тогда
		CW_Бюджетирование.ПриИзмененииСуммыВсегоСтатьиБюджета(Объект);
	Иначе 
		CW_Бюджетирование.ПриИзмененииСуммыСтатьиБюджета(Объект);
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьИзменениеРеквитовОбъектов(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	Для Каждого СправочникСсылка из ПараметрыПроцедуры.Ссылки Цикл
		
		СправочникОбъект =  СправочникСсылка.ПолучитьОбъект();
		
		Для Каждого КлючЗначение из ПараметрыПроцедуры.ЗначенияРеквизитов Цикл
			СправочникОбъект[КлючЗначение.Ключ] = КлючЗначение.Значение;  
			
			// обработка изменения реквизита
			Если (КлючЗначение.Ключ = "Количество") или (КлючЗначение.Ключ = "Цена") или (КлючЗначение.Ключ = "ЦенаСНДС") Тогда
				CW_Бюджетирование.ПриИзмененииЦеныСтатьиБюджета(СправочникОбъект);   
				
			ИначеЕсли КлючЗначение.Ключ = "Сумма" Тогда
				CW_Бюджетирование.ПриИзмененииСуммыСтатьиБюджета(СправочникОбъект);
				
			ИначеЕсли КлючЗначение.Ключ = "СтавкаНДС" Тогда
				ПересчетСуммСтатьи(СправочникОбъект);
				
			ИначеЕсли КлючЗначение.Ключ = "СуммаНДС" Тогда
				CW_Бюджетирование.ПриИзмененииСуммыНДССтатьиБюджета(СправочникОбъект);   
				
			ИначеЕсли КлючЗначение.Ключ = "УчитыватьНДСВСебестоимости" Тогда
				CW_Бюджетирование.ПриИзмененииСуммыВсегоСтатьиБюджета(СправочникОбъект); 
				
			ИначеЕсли (КлючЗначение.Ключ = "Валюта") или (КлючЗначение.Ключ = "Курс") или (КлючЗначение.Ключ = "Кратность") Тогда
				ПересчетСуммСтатьи(СправочникОбъект); 
				
			КонецЕсли;
			
		КонецЦикла;                                                         
		
        СправочникОбъект.CW_Редактор = ПараметрыСеанса.ТекущийПользователь;
        СправочникОбъект.CW_ДатаРедактирования = ТекущаяДата();
		
		СправочникОбъект.Записать();     
		
	КонецЦикла;
	
КонецПроцедуры

//Процедуры обновления


//Процедуры обновления

#КонецЕсли

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	Поля.Добавить("Номенклатура");
	Поля.Добавить("Контрагент");
	Поля.Добавить("СуммаВсего");
	Поля.Добавить("Валюта");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = ложь;
	
	Массив = Новый Массив;
	
	Если ЗначениеЗаполнено(Данные.Номенклатура) Тогда
		Массив.Добавить(Данные.Номенклатура);            
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.Контрагент) Тогда
		Массив.Добавить(Данные.Контрагент);
	КонецЕсли;
	
	Массив.Добавить(Формат(Данные.СуммаВсего, "ЧДЦ=2; ЧН=0.00")+" "+СокрЛП(Данные.Валюта));
	
	Представление = СтрСоединить(Массив, ", ");

КонецПроцедуры
